piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
/**
 *******************************************************************************
 * @file    MDR32VF0xI_timer.c
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    28/01/2025
 * @brief   This file contains all the TIMER firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_timer.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @addtogroup TIMER TIMER
 * @{
 */

/** @defgroup TIMER_Private_Defines TIMER Private Defines
 * @{
 */

#define IS_TIMER_ALL_PERIPH(PERIPH) (((PERIPH) == MDR_TIMER1) || \
                                     ((PERIPH) == MDR_TIMER2) || \
                                     ((PERIPH) == MDR_TIMER3) || \
                                     ((PERIPH) == MDR_TIMER4))

/** @} */ /* End of the group TIMER_Private_Defines */

/** @addtogroup TIMER_Exported_Functions TIMER Exported Functions
 * @{
 */

/**
 * @brief  Deinitialize the TIMERx peripheral registers to their default reset values.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return None.
 */
void TIMER_DeInit(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->CNTRL = 0;
    TIMERx->CNT   = 0;
    TIMERx->PSG   = 0;
    TIMERx->ARR   = 0;

    TIMERx->CH1_CNTRL0 = 0;
    TIMERx->CH1_CNTRL1 = 0;
    TIMERx->CH1_CNTRL2 = 0;
    TIMERx->CH1_DTG    = 0;
    TIMERx->CH1_CCR    = 0;
    TIMERx->CH1_CCR1   = 0;

    TIMERx->CH2_CNTRL0 = 0;
    TIMERx->CH2_CNTRL1 = 0;
    TIMERx->CH2_CNTRL2 = 0;
    TIMERx->CH2_DTG    = 0;
    TIMERx->CH2_CCR    = 0;
    TIMERx->CH2_CCR1   = 0;

    TIMERx->CH3_CNTRL0 = 0;
    TIMERx->CH3_CNTRL1 = 0;
    TIMERx->CH3_CNTRL2 = 0;
    TIMERx->CH3_DTG    = 0;
    TIMERx->CH3_CCR    = 0;
    TIMERx->CH3_CCR1   = 0;

    TIMERx->CH4_CNTRL0 = 0;
    TIMERx->CH4_CNTRL1 = 0;
    TIMERx->CH4_CNTRL2 = 0;
    TIMERx->CH4_DTG    = 0;
    TIMERx->CH4_CCR    = 0;
    TIMERx->CH4_CCR1   = 0;

    TIMERx->BRKETR_CNTRL = 0;
    TIMERx->STATUS       = 0;
    TIMERx->IE           = 0;
    TIMERx->DMA_RE       = 0;
}

/**
 * @brief  Initialize the TIMERx counter according to
 *         the specified parameters in the TIMER_CntInitStruct.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  TIMER_CntInitStruct: The pointer to the @ref TIMER_CNT_InitTypeDef structure
 *         that contains the configuration information for the specified counter.
 * @return None.
 */
void TIMER_CNT_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CNT_InitTypeDef* TIMER_CntInitStruct)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CNT_EVENT_SOURCE(TIMER_CntInitStruct->TIMER_CNT_EventSource));
    assert_param(IS_TIMER_CNT_MODE(TIMER_CntInitStruct->TIMER_CNT_Mode));
    assert_param(IS_TIMER_CNT_DIR(TIMER_CntInitStruct->TIMER_CNT_Direction));
    assert_param(IS_TIMER_CNT_PERIOD_UPDATE_MODE(TIMER_CntInitStruct->TIMER_CNT_PeriodUpdateMode));
    assert_param(IS_TIMER_FDTS_PRESCALER(TIMER_CntInitStruct->TIMER_FDTS_Prescaler));
    assert_param(IS_TIMER_ETR_FILTER(TIMER_CntInitStruct->TIMER_ETR_Filter));
    assert_param(IS_TIMER_ETR_PRESCALER(TIMER_CntInitStruct->TIMER_ETR_Prescaler));
    assert_param(IS_TIMER_ETR_POLARITY(TIMER_CntInitStruct->TIMER_ETR_Polarity));
    assert_param(IS_TIMER_BRK_POLARITY(TIMER_CntInitStruct->TIMER_BRK_Polarity));

    TIMERx->CNT = TIMER_CntInitStruct->TIMER_CNT_Counter;
    TIMERx->PSG = TIMER_CntInitStruct->TIMER_CNT_Prescaler;
    TIMERx->ARR = TIMER_CntInitStruct->TIMER_CNT_Period;

    /* Form a new value for the CNTRL register. */
    TmpReg = (uint32_t)TIMER_CntInitStruct->TIMER_CNT_EventSource |
             (uint32_t)TIMER_CntInitStruct->TIMER_CNT_Mode |
             (uint32_t)TIMER_CntInitStruct->TIMER_CNT_Direction |
             (uint32_t)TIMER_CntInitStruct->TIMER_CNT_PeriodUpdateMode |
             (uint32_t)TIMER_CntInitStruct->TIMER_FDTS_Prescaler;

    /* Configure the CNTRL register with a new value. */
    TIMERx->CNTRL = TmpReg;

    /* Form a new value for the BRKETR_CNTRL register. */
    TmpReg = (uint32_t)TIMER_CntInitStruct->TIMER_ETR_Filter |
             (uint32_t)TIMER_CntInitStruct->TIMER_ETR_Prescaler |
             (uint32_t)TIMER_CntInitStruct->TIMER_ETR_Polarity |
             (uint32_t)TIMER_CntInitStruct->TIMER_BRK_Polarity;

    /* Configure the BRKETR_CNTRL register with a new value. */
    TIMERx->BRKETR_CNTRL = TmpReg;
}

/**
 * @brief  Fill each TIMER_CntInitStruct member with its default value.
 * @param  TIMER_CntInitStruct: The pointer to the @ref TIMER_CNT_InitTypeDef structure
 *         which is to be initialized.
 * @return None.
 */
void TIMER_CNT_StructInit(TIMER_CNT_InitTypeDef* TIMER_CntInitStruct)
{
    TIMER_CntInitStruct->TIMER_CNT_Counter          = 0;
    TIMER_CntInitStruct->TIMER_CNT_Prescaler        = 0;
    TIMER_CntInitStruct->TIMER_CNT_Period           = 0;
    TIMER_CntInitStruct->TIMER_CNT_EventSource      = TIMER_CNT_EVNT_SRC_TIM_CLK;
    TIMER_CntInitStruct->TIMER_CNT_Mode             = TIMER_CNT_MODE_CLK_FIXED_DIR;
    TIMER_CntInitStruct->TIMER_CNT_Direction        = TIMER_CNT_DIR_UP;
    TIMER_CntInitStruct->TIMER_CNT_PeriodUpdateMode = TIMER_CNT_PERIOD_UPD_IMMEDIATELY;
    TIMER_CntInitStruct->TIMER_FDTS_Prescaler       = TIMER_FDTS_PRESCALER_DIV_1;
    TIMER_CntInitStruct->TIMER_ETR_Filter           = TIMER_ETR_FILTER_1FF_AT_FDTS;
    TIMER_CntInitStruct->TIMER_ETR_Prescaler        = TIMER_ETR_PRESCALER_DIV_1;
    TIMER_CntInitStruct->TIMER_ETR_Polarity         = TIMER_ETR_POLARITY_NON_INV;
    TIMER_CntInitStruct->TIMER_BRK_Polarity         = TIMER_BRK_POLARITY_NON_INV;
}

/**
 * @brief  Enable or disable the specified TIMERx counter.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  NewState: @ref FunctionalState - a new state of the counter.
 * @return None.
 */
void TIMER_CNT_Cmd(MDR_TIMER_TypeDef* TIMERx, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form a new value. */
    if (NewState != DISABLE) {
        /* Enable the TIMERx counter by setting the CNT_EN bit in the CNTRL register. */
        TIMERx->CNTRL |= TIMER_CNTRL_CNT_EN;
    } else {
        /* Disable the TIMERx counter by clearing the CNT_EN bit in the CNTRL register. */
        TIMERx->CNTRL &= ~TIMER_CNTRL_CNT_EN;
    }
}

/**
 * @brief  Get a specified TIMERx counter work state.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return @ref FunctionalState - the current work state of the specified TIMERx counter.
 */
FunctionalState TIMER_CNT_GetCmdState(MDR_TIMER_TypeDef* TIMERx)
{
    FunctionalState State;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    if ((TIMERx->CNTRL & TIMER_CNTRL_CNT_EN) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

