piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    return State;
}

/**
 * @brief  Set the TIMERx counter register value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Counter: Specify a new value of the counter register.
 * @return None.
 */
void TIMER_CNT_SetCounter(MDR_TIMER_TypeDef* TIMERx, uint32_t Counter)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->CNT = Counter;
}

/**
 * @brief  Return the TIMERx counter register value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return Counter register value.
 */
uint32_t TIMER_CNT_GetCounter(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return TIMERx->CNT;
}

/**
 * @brief  Set the TIMERx TIM_CLK prescaler register value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Prescaler: Specify the TIM_CLK prescaler register value.
 * @return None.
 */
void TIMER_CNT_SetPrescaler(MDR_TIMER_TypeDef* TIMERx, uint32_t Prescaler)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->PSG = Prescaler;
}

/**
 * @brief  Return the TIMERx TIM_CLK prescaler register value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return TIM_CLK prescaler register value.
 */
uint32_t TIMER_CNT_GetPrescaler(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return TIMERx->PSG;
}

/**
 * @brief  Set the TIMERx counter period (ARR register) update mode.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  PeriodUpdateMode: @ref TIMER_CNT_PeriodUpdateMode_TypeDef - specify the counter period (ARR register) update mode.
 * @return None.
 */
void TIMER_CNT_SetPeriodUpdateMode(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_PeriodUpdateMode_TypeDef PeriodUpdateMode)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CNT_PERIOD_UPDATE_MODE(PeriodUpdateMode));

    TmpReg = TIMERx->CNTRL;
    TmpReg &= ~TIMER_CNTRL_ARRB_EN;
    TmpReg |= (uint32_t)PeriodUpdateMode;
    TIMERx->CNTRL = TmpReg;
}

/**
 * @brief  Set the TIMERx counter period (ARR register) value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Period: Specify the counter period (ARR register) value. The full counter period is Period + 1.
 * @return None.
 */
void TIMER_CNT_SetPeriod(MDR_TIMER_TypeDef* TIMERx, uint32_t Period)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    TIMERx->ARR = Period;
}

/**
 * @brief  Return the TIMERx counter period (ARR register) value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return Counter period (ARR register) value.
 */
uint32_t TIMER_CNT_GetPeriod(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return TIMERx->ARR;
}

/**
 * @brief  Configure the TIMERx FDTS prescaler.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Prescaler: @ref TIMER_FDTS_Prescaler_TypeDef - specify the FDTS prescaler.
 * @return None.
 */
void TIMER_FDTS_SetPrescaler(MDR_TIMER_TypeDef* TIMERx, TIMER_FDTS_Prescaler_TypeDef Prescaler)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FDTS_PRESCALER(Prescaler));

    TmpReg = TIMERx->CNTRL;
    TmpReg &= ~TIMER_CNTRL_FDTS_Msk;
    TmpReg |= (uint32_t)Prescaler;
    TIMERx->CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx counter event source.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  EventSource: @ref TIMER_CNT_EventSource_TypeDef - specify the counter event source.
 * @return None.
 */
void TIMER_CNT_EventSourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_EventSource_TypeDef EventSource)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CNT_EVENT_SOURCE(EventSource));

    TmpReg = TIMERx->CNTRL;
    TmpReg &= ~TIMER_CNTRL_EVNT_SEL_Msk;
    TmpReg |= (uint32_t)EventSource;
    TIMERx->CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx counter mode.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Mode: @ref TIMER_CNT_Mode_TypeDef - specify the counter mode.
 * @return None.
 */
void TIMER_CNT_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_Mode_TypeDef Mode)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CNT_MODE(Mode));

    TmpReg = TIMERx->CNTRL;
    TmpReg &= ~TIMER_CNTRL_CNT_MODE_Msk;
    TmpReg |= (uint32_t)Mode;
    TIMERx->CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx counter direction.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Direction: @ref TIMER_CNT_Dir_TypeDef - specify the counter direction.
 * @return None.
 */
void TIMER_CNT_SetDirection(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_Dir_TypeDef Direction)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CNT_DIR(Direction));

    TmpReg = TIMERx->CNTRL;
    TmpReg &= ~TIMER_CNTRL_DIR;
    TmpReg |= (uint32_t)Direction;
    TIMERx->CNTRL = TmpReg;
}

/**
 * @brief  Return the TIMERx counter direction.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return @ref TIMER_CNT_Dir_TypeDef - the current counter direction.
 */
TIMER_CNT_Dir_TypeDef TIMER_CNT_GetDirection(MDR_TIMER_TypeDef* TIMERx)
{
    TIMER_CNT_Dir_TypeDef Direction;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    if ((TIMERx->CNTRL & TIMER_CNTRL_DIR) == 0) {
        Direction = TIMER_CNT_DIR_UP;
    } else {
        Direction = TIMER_CNT_DIR_DOWN;
    }

    return Direction;
}

/**
 * @brief  Check whether the TIMERx CNT, PSG or ARR write operation is in progress or not.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return @ref FlagStatus - the CNTRL.WR_CMPL flag current state:
 *             @arg SET:   Writing to the CNT, PSG or ARR registers is in progress.
 *             @arg RESET: Writing to the CNT, PSG or ARR registers is completed.
 */
FlagStatus TIMER_CNT_GetWriteStatus(MDR_TIMER_TypeDef* TIMERx)
{
    FlagStatus Status;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    if ((TIMERx->CNTRL & TIMER_CNTRL_WR_CMPL) == 0) {
        Status = RESET;
    } else {
        Status = SET;
    }

