piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    return Status;
}

/**
 * @brief  Configure the TIMERx ETR input.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Prescaler: @ref TIMER_ETR_Prescaler_TypeDef - specify the ETR signal prescaler value.
 * @param  Polarity: @ref TIMER_ETR_Polarity_TypeDef - enable or disable inversion of the ETR input.
 * @param  Filter: @ref TIMER_ETR_Filter_TypeDef - specify the ETR filter configuration.
 * @return None.
 */
void TIMER_ETR_InputConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Prescaler_TypeDef Prescaler, TIMER_ETR_Polarity_TypeDef Polarity, TIMER_ETR_Filter_TypeDef Filter)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_PRESCALER(Prescaler));
    assert_param(IS_TIMER_ETR_POLARITY(Polarity));
    assert_param(IS_TIMER_ETR_FILTER(Filter));

    TmpReg = TIMERx->BRKETR_CNTRL;
    TmpReg &= ~(TIMER_BRKETR_CNTRL_ETR_FLTR_Msk | TIMER_BRKETR_CNTRL_ETR_PSC_Msk | TIMER_BRKETR_CNTRL_ETR_INV);
    TmpReg |= (uint32_t)Prescaler |
              (uint32_t)Polarity |
              (uint32_t)Filter;
    TIMERx->BRKETR_CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx ETR filter.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Filter: @ref TIMER_ETR_Filter_TypeDef - specify the ETR filter configuration.
 * @return None.
 */
void TIMER_ETR_FilterConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Filter_TypeDef Filter)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_FILTER(Filter));

    TmpReg = TIMERx->BRKETR_CNTRL;
    TmpReg &= ~TIMER_BRKETR_CNTRL_ETR_FLTR_Msk;
    TmpReg |= (uint32_t)Filter;
    TIMERx->BRKETR_CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx ETR signal prescaler value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Prescaler: @ref TIMER_ETR_Prescaler_TypeDef - specify the ETR signal prescaler value.
 * @return None.
 */
void TIMER_ETR_PrescalerConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Prescaler_TypeDef Prescaler)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_PRESCALER(Prescaler));

    TmpReg = TIMERx->BRKETR_CNTRL;
    TmpReg &= ~TIMER_BRKETR_CNTRL_ETR_PSC_Msk;
    TmpReg |= (uint32_t)Prescaler;
    TIMERx->BRKETR_CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx ETR input inversion.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Polarity: @ref TIMER_ETR_Polarity_TypeDef - enable or disable inversion of the ETR input.
 * @return None.
 */
void TIMER_ETR_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Polarity_TypeDef Polarity)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_ETR_POLARITY(Polarity));

    TmpReg = TIMERx->BRKETR_CNTRL;
    TmpReg &= ~TIMER_BRKETR_CNTRL_ETR_INV;
    TmpReg |= (uint32_t)Polarity;
    TIMERx->BRKETR_CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx BRK input inversion.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Polarity: @ref TIMER_BRK_Polarity_TypeDef - enable or disable inversion of the BRK input.
 * @return None.
 */
void TIMER_BRK_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_BRK_Polarity_TypeDef Polarity)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_BRK_POLARITY(Polarity));

    TmpReg = TIMERx->BRKETR_CNTRL;
    TmpReg &= ~TIMER_BRKETR_CNTRL_BRK_INV;
    TmpReg |= (uint32_t)Polarity;
    TIMERx->BRKETR_CNTRL = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel filter.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  Filter: @ref TIMER_CH_Filter_TypeDef - specify the channel filter configuration.
 * @return None.
 */
void TIMER_CH_FilterConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_Filter_TypeDef Filter)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_FILTER(Filter));

    PtrReg = &TIMERx->CH1_CNTRL0 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL0_CH_FLTR_Msk;
    TmpReg |= (uint32_t)Filter;
    *PtrReg = TmpReg;
}

/**
 * @brief  Initialize the TIMERx channel according to
 *         the specified parameters in the TIMER_ChInitStruct.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  TIMER_ChInitStruct: The pointer to the @ref TIMER_CH_InitTypeDef structure
 *         that contains the configuration information for a specified channel.
 * @return None.
 */
void TIMER_CH_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CH_InitTypeDef* TIMER_ChInitStruct)
{
    uint32_t Channel;
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(TIMER_ChInitStruct->TIMER_CH_Number));
    assert_param(IS_TIMER_CH_MODE(TIMER_ChInitStruct->TIMER_CH_Mode));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_UseCCR1));
    assert_param(IS_TIMER_CH_PWM_REF_FORMAT(TIMER_ChInitStruct->TIMER_CH_PWM_REF_Format));
    assert_param(IS_TIMER_CH_PWM_CCR_UPDATE_MODE(TIMER_ChInitStruct->TIMER_CH_PWM_CCR_UpdateMode));
    assert_param(IS_TIMER_CH_PWM_DTG_CLK_SOURCE(TIMER_ChInitStruct->TIMER_CH_PWM_DTG_ClockSource));
    assert_param(IS_TIMER_CH_PWM_DTG_AUX_PRESCALER(TIMER_ChInitStruct->TIMER_CH_PWM_DTG_AuxPrescaler));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_PWM_ETR_UseReset));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_PWM_BRK_UseReset));
    assert_param(IS_TIMER_CH_CAP_CCR_EVENT_SOURCE(TIMER_ChInitStruct->TIMER_CH_CAP_CCR_EventSource));
    assert_param(IS_TIMER_CH_CAP_CCR1_EVENT_SOURCE(TIMER_ChInitStruct->TIMER_CH_CAP_CCR1_EventSource));
    assert_param(IS_TIMER_CH_CAP_EVENT_PRESCALER(TIMER_ChInitStruct->TIMER_CH_CAP_EventPrescaler));
    assert_param(IS_FUNCTIONAL_STATE(TIMER_ChInitStruct->TIMER_CH_CAP_UseEventDelay));
    assert_param(IS_TIMER_CH_FILTER(TIMER_ChInitStruct->TIMER_CH_CAP_Filter));

