piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    Channel = (uint32_t)TIMER_ChInitStruct->TIMER_CH_Number;

    TmpReg = ((uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_DTG_MainPrescaler << TIMER_CH_DTG_DTG_Pos) |
             ((uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_DTG_AuxPrescaler << TIMER_CH_DTG_DTGX_Pos) |
             (uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_DTG_ClockSource;

    *(&TIMERx->CH1_DTG + Channel) = TmpReg;

    TmpReg = (uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_CCR_UpdateMode |
             (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_CCR1_EventSource |
             ((uint32_t)TIMER_ChInitStruct->TIMER_CH_UseCCR1 << TIMER_CH_CNTRL2_CCR1_EN_Pos) |
             ((uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_UseEventDelay << TIMER_CH_CNTRL2_EVNT_DLY_Pos);

    *(&TIMERx->CH1_CNTRL2 + Channel) = TmpReg;

    TmpReg = (uint32_t)TIMER_ChInitStruct->TIMER_CH_Mode |
             (uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_REF_Format |
             (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_EventPrescaler |
             (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_CCR_EventSource |
             (uint32_t)TIMER_ChInitStruct->TIMER_CH_CAP_Filter |
             ((uint32_t)TIMER_ChInitStruct->TIMER_CH_PWM_BRK_UseReset << TIMER_CH_CNTRL0_BRK_EN_Pos);

    if (TIMER_ChInitStruct->TIMER_CH_PWM_ETR_UseReset != DISABLE) {
        TmpReg |= TIMER_CH_CNTRL0_ETR_EN | TIMER_CH_CNTRL0_OCCE;
    }

    *(&TIMERx->CH1_CNTRL0 + Channel) = TmpReg;
}

/**
 * @brief  Fill each TIMER_ChInitStruct member with its default value.
 * @param  TIMER_ChInitStruct: The pointer to the @ref TIMER_CH_InitTypeDef structure
 *         which is to be initialized.
 * @return None.
 */
void TIMER_CH_StructInit(TIMER_CH_InitTypeDef* TIMER_ChInitStruct)
{
    /* General channel parameters. */
    TIMER_ChInitStruct->TIMER_CH_Number  = TIMER_CH1;
    TIMER_ChInitStruct->TIMER_CH_Mode    = TIMER_CH_MODE_PWM;
    TIMER_ChInitStruct->TIMER_CH_UseCCR1 = DISABLE;

    /* Channel parameters if the PWM mode is selected. */
    TIMER_ChInitStruct->TIMER_CH_PWM_REF_Format        = TIMER_CH_PWM_REF_FORMAT_0;
    TIMER_ChInitStruct->TIMER_CH_PWM_CCR_UpdateMode    = TIMER_CH_PWM_CCR_UPD_IMMEDIATELY;
    TIMER_ChInitStruct->TIMER_CH_PWM_DTG_ClockSource   = TIMER_CH_PWM_DTG_CLK_SRC_TIM_CLK;
    TIMER_ChInitStruct->TIMER_CH_PWM_DTG_MainPrescaler = 0;
    TIMER_ChInitStruct->TIMER_CH_PWM_DTG_AuxPrescaler  = 0;
    TIMER_ChInitStruct->TIMER_CH_PWM_ETR_UseReset      = DISABLE;
    TIMER_ChInitStruct->TIMER_CH_PWM_BRK_UseReset      = DISABLE;

    /* Channel parameters if the capture mode is selected. */
    TIMER_ChInitStruct->TIMER_CH_CAP_CCR_EventSource  = TIMER_CH_CAP_CCR_EVNT_SRC_RE;
    TIMER_ChInitStruct->TIMER_CH_CAP_CCR1_EventSource = TIMER_CH_CAP_CCR1_EVNT_SRC_RE;
    TIMER_ChInitStruct->TIMER_CH_CAP_EventPrescaler   = TIMER_CH_CAP_EVNT_PRESCALER_DIV_1;
    TIMER_ChInitStruct->TIMER_CH_CAP_UseEventDelay    = ENABLE;
    TIMER_ChInitStruct->TIMER_CH_CAP_Filter           = TIMER_CH_FILTER_1FF_AT_FDTS;
}

/**
 * @brief  Set the TIMERx channel capture/compare register (CCR) value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  CCR: Specify a new value of the capture/compare register (CCR).
 * @return None.
 */
void TIMER_CH_SetCCR(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint32_t CCR)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    *(&TIMERx->CH1_CCR + (uint32_t)Channel) = CCR;
}

/**
 * @brief  Return the TIMERx channel capture/compare register (CCR) value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @return Channel capture/compare register (CCR) value.
 */
uint32_t TIMER_CH_GetCCR(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    return (uint32_t)*(&TIMERx->CH1_CCR + (uint32_t)Channel);
}

/**
 * @brief  Check whether the TIMERx CCR write operation is in progress or not.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @return @ref FlagStatus - the CHy_CNTRL0.WR_CMPL flag current state:
 *             @arg SET:   Writing to the CCR is in progress.
 *             @arg RESET: Writing to the CCR is completed.
 */
FlagStatus TIMER_CH_GetCCRWriteStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    __IO uint32_t* PtrReg;
    FlagStatus     Status;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    PtrReg = &TIMERx->CH1_CNTRL0 + (uint32_t)Channel;

    if ((*PtrReg & TIMER_CH_CNTRL0_WR_CMPL) == 0) {
        Status = RESET;
    } else {
        Status = SET;
    }

    return Status;
}

/**
 * @brief  Enable or disable the TIMERx channel CCR1 register.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  NewState: @ref FunctionalState - a new state of the CCR1_EN bit.
 * @return None.
 */
void TIMER_CH_CCR1Cmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState)
{
    __IO uint32_t* PtrReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    PtrReg = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    /* Form a new value. */
    if (NewState != DISABLE) {
        /* Enable the TIMERx channel CCR1 register by setting the CCR1_EN bit in the CHy_CNTRL2 register. */
        *PtrReg |= TIMER_CH_CNTRL2_CCR1_EN;
    } else {
        /* Disable the TIMERx channel CCR1 register by clearing the CCR1_EN bit in the CHy_CNTRL2 register. */
        *PtrReg &= ~TIMER_CH_CNTRL2_CCR1_EN;
    }
}

/**
 * @brief  Get the TIMERx channel CCR1 register work state.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @return @ref FunctionalState - the current state of the CCR1_EN bit.
 */
FunctionalState TIMER_CH_GetCCR1CmdState(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    FunctionalState State;
    __IO uint32_t*  PtrReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    PtrReg = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    if ((*PtrReg & TIMER_CH_CNTRL2_CCR1_EN) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

