piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    return State;
}

/**
 * @brief  Set TIMERx channel capture/compare register 1 (CCR1) value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  CCR1: Specify a new value of channel capture/compare register 1 (CCR1).
 * @return None.
 */
void TIMER_CH_SetCCR1(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint32_t CCR1)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    *(&TIMERx->CH1_CCR1 + (uint32_t)Channel) = CCR1;
}

/**
 * @brief  Return TIMERx channel capture/compare register 1 (CCR1) value.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @return Channel capture/compare register 1 (CCR1) value.
 */
uint32_t TIMER_CH_GetCCR1(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    return (uint32_t)*(&TIMERx->CH1_CCR1 + (uint32_t)Channel);
}

/**
 * @brief  Check whether the TIMERx CCR1 write operation is in progress or not.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @return @ref FlagStatus - the CHy_CNTRL0.WR_CMPL1 flag current state:
 *             @arg SET:   Writing  to CCR1 is in progress.
 *             @arg RESET: Writing to CCR1 is completed.
 */
FlagStatus TIMER_CH_GetCCR1WriteStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    __IO uint32_t* PtrReg;
    FlagStatus     Status;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    PtrReg = &TIMERx->CH1_CNTRL0 + (uint32_t)Channel;

    if ((*PtrReg & TIMER_CH_CNTRL0_WR_CMPL1) == 0) {
        Status = RESET;
    } else {
        Status = SET;
    }

    return Status;
}

/**
 * @brief  Set the TIMERx channel capture/compare registers (CCR and CCR1) update mode.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  UpdateMode: @ref TIMER_CH_PWM_CCR_UpdateMode_TypeDef - specify the channel capture/compare registers (CCR and CCR1) update mode.
 * @return None.
 */
void TIMER_CH_PWM_SetCompareUpdateMode(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_PWM_CCR_UpdateMode_TypeDef UpdateMode)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_PWM_CCR_UPDATE_MODE(UpdateMode));

    PtrReg = &TIMERx->CH1_CNTRL2 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL2_CCR_RLD;
    TmpReg |= (uint32_t)UpdateMode;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx REF signal format.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  Format: @ref TIMER_CH_PWM_REF_Format_TypeDef - a new value of the REF signal format.
 * @return None.
 */
void TIMER_CH_PWM_REF_FormatConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_PWM_REF_Format_TypeDef Format)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_PWM_REF_FORMAT(Format));

    PtrReg = &TIMERx->CH1_CNTRL0 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL0_OCCM_Msk;
    TmpReg |= (uint32_t)Format;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx dead time generator (DTG).
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  MainPrescaler: Specify a main prescaler value.
 *         This parameter can be a number from 0x00 to 0xFF.
 * @param  AuxPrescaler: Specify an auxiliary prescaler value.
 *         This parameter can be a number from 0x00 to 0x0F.
 * @param  ClockSource: @ref TIMER_CH_PWM_DTG_ClockSource_TypeDef - specify the DTG clock source.
 * @return None.
 */
void TIMER_CH_PWM_DTG_Config(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint8_t MainPrescaler, uint8_t AuxPrescaler, TIMER_CH_PWM_DTG_ClockSource_TypeDef ClockSource)
{
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_PWM_DTG_AUX_PRESCALER(AuxPrescaler));
    assert_param(IS_TIMER_CH_PWM_DTG_CLK_SOURCE(ClockSource));

    TmpReg = ((uint32_t)MainPrescaler << TIMER_CH_DTG_DTG_Pos) |
             ((uint32_t)AuxPrescaler << TIMER_CH_DTG_DTGX_Pos) |
             (uint32_t)ClockSource;

    *(&TIMERx->CH1_DTG + (uint32_t)Channel) = TmpReg;
}

/**
 * @brief  Enable or disable the TIMERx channel ETR reset (the REF reset when the ETR input is high).
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  NewState: @ref FunctionalState - a new state of the ETR reset.
 * @return None.
 */
void TIMER_CH_PWM_ETR_ResetCmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState)
{
    __IO uint32_t* PtrReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    PtrReg = &TIMERx->CH1_CNTRL0 + (uint32_t)Channel;

    /* Form a new value. */
    if (NewState != DISABLE) {
        /* Enable the TIMERx channel ETR reset by setting the ETR_EN and OCCE bits in the CHy_CNTRL0 register. */
        *PtrReg |= TIMER_CH_CNTRL0_ETR_EN | TIMER_CH_CNTRL0_OCCE;
    } else {
        /* Disable the TIMERx channel ETR reset by clearing the ETR_EN and OCCE bits in the CHy_CNTRL0 register. */
        *PtrReg &= ~(TIMER_CH_CNTRL0_ETR_EN | TIMER_CH_CNTRL0_OCCE);
    }
}

/**
 * @brief  Get the TIMERx channel ETR reset work state.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @return @ref FunctionalState - the current work state of the TIMERx channel ETR reset.
 */
FunctionalState TIMER_CH_PWM_ETR_GetResetCmdState(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel)
{
    FunctionalState State;
    __IO uint32_t*  PtrReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));

    PtrReg = &TIMERx->CH1_CNTRL0 + (uint32_t)Channel;

    if ((*PtrReg & (TIMER_CH_CNTRL0_ETR_EN | TIMER_CH_CNTRL0_OCCE)) != (TIMER_CH_CNTRL0_ETR_EN | TIMER_CH_CNTRL0_OCCE)) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

