piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    return State;
}

/**
 * @brief  Initialize the TIMERx channel output according to
 *         the specified parameters in the TIMER_ChOutInitStruct.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  TIMER_ChOutInitStruct: The pointer to the @ref TIMER_CH_OUT_InitTypeDef structure
 *         that contains the configuration information for the specified channel outputs.
 * @return None.
 */
void TIMER_CH_OUT_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CH_OUT_InitTypeDef* TIMER_ChOutInitStruct)
{
    uint32_t Channel;
    uint32_t TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(TIMER_ChOutInitStruct->TIMER_CH_Number));
    assert_param(IS_TIMER_CH_OUTP_POLARITY(TIMER_ChOutInitStruct->TIMER_CH_OUTP_Polarity));
    assert_param(IS_TIMER_CH_OUTP_SOURCE(TIMER_ChOutInitStruct->TIMER_CH_OUTP_Source));
    assert_param(IS_TIMER_CH_OUTP_MODE(TIMER_ChOutInitStruct->TIMER_CH_OUTP_Mode));
    assert_param(IS_TIMER_CH_OUTN_POLARITY(TIMER_ChOutInitStruct->TIMER_CH_OUTN_Polarity));
    assert_param(IS_TIMER_CH_OUTN_SOURCE(TIMER_ChOutInitStruct->TIMER_CH_OUTN_Source));
    assert_param(IS_TIMER_CH_OUTN_MODE(TIMER_ChOutInitStruct->TIMER_CH_OUTN_Mode));

    Channel = (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_Number;

    TmpReg = (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTP_Polarity |
             (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTP_Source |
             (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTP_Mode |
             (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTN_Polarity |
             (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTN_Source |
             (uint32_t)TIMER_ChOutInitStruct->TIMER_CH_OUTN_Mode;

    *(&TIMERx->CH1_CNTRL1 + Channel) = TmpReg;
}

/**
 * @brief  Fill each TIMER_ChOutInitStruct member with its default value.
 * @param  TIMER_ChOutInitStruct: The pointer to the @ref TIMER_CH_OUT_InitTypeDef structure
 *         which is to be initialized.
 * @return None.
 */
void TIMER_CH_OUT_StructInit(TIMER_CH_OUT_InitTypeDef* TIMER_ChOutInitStruct)
{
    TIMER_ChOutInitStruct->TIMER_CH_Number = TIMER_CH1;

    TIMER_ChOutInitStruct->TIMER_CH_OUTP_Polarity = TIMER_CH_OUTP_POLARITY_NON_INV;
    TIMER_ChOutInitStruct->TIMER_CH_OUTP_Source   = TIMER_CH_OUTP_SRC_0;
    TIMER_ChOutInitStruct->TIMER_CH_OUTP_Mode     = TIMER_CH_OUTP_MODE_IN;

    TIMER_ChOutInitStruct->TIMER_CH_OUTN_Polarity = TIMER_CH_OUTN_POLARITY_NON_INV;
    TIMER_ChOutInitStruct->TIMER_CH_OUTN_Source   = TIMER_CH_OUTN_SRC_0;
    TIMER_ChOutInitStruct->TIMER_CH_OUTN_Mode     = TIMER_CH_OUTN_MODE_IN;
}

/**
 * @brief  Configure the TIMERx channel positive output.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  OutSource: @ref TIMER_CH_OUTP_Source_TypeDef - specify the channel positive output source.
 * @param  Mode: @ref TIMER_CH_OUTP_Mode_TypeDef - specify the channel positive output mode (output enable source).
 * @param  Polarity: @ref TIMER_CH_OUTP_Polarity_TypeDef - enable or disable the channel positive output inversion.
 * @return None.
 */
void TIMER_CH_OUTP_Config(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Source_TypeDef OutSource, TIMER_CH_OUTP_Mode_TypeDef Mode, TIMER_CH_OUTP_Polarity_TypeDef Polarity)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTP_SOURCE(OutSource));
    assert_param(IS_TIMER_CH_OUTP_MODE(Mode));
    assert_param(IS_TIMER_CH_OUTP_POLARITY(Polarity));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~(TIMER_CH_CNTRL1_INV | TIMER_CH_CNTRL1_SELO_Msk | TIMER_CH_CNTRL1_SELOE_Msk);
    TmpReg |= (uint32_t)Polarity |
              (uint32_t)OutSource |
              (uint32_t)Mode;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel positive output source.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  OutSource: @ref TIMER_CH_OUTP_Source_TypeDef - specify the channel positive output source.
 * @return None.
 */
void TIMER_CH_OUTP_SourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Source_TypeDef OutSource)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTP_SOURCE(OutSource));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL1_SELO_Msk;
    TmpReg |= (uint32_t)OutSource;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel positive output mode (output enable source).
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  Mode: @ref TIMER_CH_OUTP_Mode_TypeDef - specify the channel positive output mode (output enable source).
 * @return None.
 */
void TIMER_CH_OUTP_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Mode_TypeDef Mode)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTP_MODE(Mode));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

