piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL1_SELOE_Msk;
    TmpReg |= (uint32_t)Mode;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel positive output polarity.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  Polarity: @ref TIMER_CH_OUTP_Polarity_TypeDef - enable or disable the channel positive output inversion.
 * @return None.
 */
void TIMER_CH_OUTP_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTP_Polarity_TypeDef Polarity)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTP_POLARITY(Polarity));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL1_INV;
    TmpReg |= (uint32_t)Polarity;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel negative output.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  OutSource: @ref TIMER_CH_OUTN_Source_TypeDef - specify the channel negative output source.
 * @param  Mode: @ref TIMER_CH_OUTN_Mode_TypeDef - specify the channel negative output mode (output enable source).
 * @param  Polarity: @ref TIMER_CH_OUTN_Polarity_TypeDef - enable or disable the channel negative output inversion.
 * @return None.
 */
void TIMER_CH_OUTN_Config(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Source_TypeDef OutSource, TIMER_CH_OUTN_Mode_TypeDef Mode, TIMER_CH_OUTN_Polarity_TypeDef Polarity)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTN_SOURCE(OutSource));
    assert_param(IS_TIMER_CH_OUTN_MODE(Mode));
    assert_param(IS_TIMER_CH_OUTN_POLARITY(Polarity));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~(TIMER_CH_CNTRL1_NINV | TIMER_CH_CNTRL1_NSELO_Msk | TIMER_CH_CNTRL1_NSELOE_Msk);
    TmpReg |= (uint32_t)Polarity |
              (uint32_t)OutSource |
              (uint32_t)Mode;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel negative output source.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  OutSource: @ref TIMER_CH_OUTN_Source_TypeDef - specify the channel negative output source.
 * @return None.
 */
void TIMER_CH_OUTN_SourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Source_TypeDef OutSource)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTN_SOURCE(OutSource));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL1_NSELO_Msk;
    TmpReg |= (uint32_t)OutSource;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel negative output mode (output enable source).
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  Mode: @ref TIMER_CH_OUTN_Mode_TypeDef - specify the channel negative output mode (output enable source).
 * @return None.
 */
void TIMER_CH_OUTN_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Mode_TypeDef Mode)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTN_MODE(Mode));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL1_NSELOE_Msk;
    TmpReg |= (uint32_t)Mode;
    *PtrReg = TmpReg;
}

/**
 * @brief  Configure the TIMERx channel negative output polarity.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify a channel number.
 * @param  Polarity: @ref TIMER_CH_OUTN_Polarity_TypeDef - enable or disable the channel negative output inversion.
 * @return None.
 */
void TIMER_CH_OUTN_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_OUTN_Polarity_TypeDef Polarity)
{
    __IO uint32_t* PtrReg;
    uint32_t       TmpReg;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_CH_NUMBER(Channel));
    assert_param(IS_TIMER_CH_OUTN_POLARITY(Polarity));

    PtrReg = &TIMERx->CH1_CNTRL1 + (uint32_t)Channel;

    TmpReg = *PtrReg;
    TmpReg &= ~TIMER_CH_CNTRL1_NINV;
    TmpReg |= (uint32_t)Polarity;
    *PtrReg = TmpReg;
}

/**
 * @brief  Check whether the specified TIMERx status flag is set or not.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Flag: @ref TIMER_Flags_TypeDef - specify a flag to check.
 * @return @ref FlagStatus - the current status flag state (SET or RESET).
 */
FlagStatus TIMER_GetFlagStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_Flags_TypeDef Flag)
{
    FlagStatus Status;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAG(Flag));

