piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_timer.c
    if ((TIMERx->STATUS & (uint32_t)Flag) != 0) {
        Status = SET;
    } else {
        Status = RESET;
    }

    return Status;
}

/**
 * @brief  Return a combined value of the TIMERx status flags.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @return A combined value of the status flags (@ref TIMER_Flags_TypeDef).
 */
uint32_t TIMER_GetStatus(MDR_TIMER_TypeDef* TIMERx)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));

    return (TIMERx->STATUS);
}

/**
 * @brief  Clear the TIMERx status flags.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  Flags: Specify the flags to clear.
 *         This parameter can be any combination of the @ref TIMER_Flags_TypeDef values.
 * @return None.
 */
void TIMER_ClearFlags(MDR_TIMER_TypeDef* TIMERx, uint32_t Flags)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAGS(Flags));

    TIMERx->STATUS = ~Flags;
}

/**
 * @brief  Enable or disable the TIMERx interrupts.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  ITs: Specify the interrupt sources to be enabled or disabled.
 *         This parameter can be any combination of the @ref TIMER_Flags_TypeDef values.
 * @param  NewState: @ref FunctionalState - a new state of the interrupts.
 * @return None.
 */
void TIMER_ITConfig(MDR_TIMER_TypeDef* TIMERx, uint32_t ITs, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAGS(ITs));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form a new value. */
    if (NewState != DISABLE) {
        /* Enable the TIMERx interrupt requests by setting bits in the IE register. */
        TIMERx->IE |= ITs;
    } else {
        /* Disable the TIMERx interrupt requests by clearing bits in the IE register. */
        TIMERx->IE &= ~ITs;
    }
}

/**
 * @brief  Enable or disable the TIMERx DMA requests.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  DMAReqs: Specify the DMA request sources.
 *         This parameter can be any combination of the @ref TIMER_Flags_TypeDef values.
 * @param  NewState: @ref FunctionalState - a new state of the DMA request sources.
 * @return None.
 */
void TIMER_DMACmd(MDR_TIMER_TypeDef* TIMERx, uint32_t DMAReqs, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAGS(DMAReqs));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Form a new value. */
    if (NewState != DISABLE) {
        /* Enable the TIMERx DMA requests by setting bits in the DMA_RE register. */
        TIMERx->DMA_RE |= DMAReqs;
    } else {
        /* Disable the TIMERx DMA requests by clearing bits in the DMA_RE register. */
        TIMERx->DMA_RE &= ~DMAReqs;
    }
}

/**
 * @brief  Get the TIMERx DMA requests work state.
 * @param  TIMERx: Select a TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in the range [1; 4].
 * @param  DMAReqs: @ref TIMER_Flags_TypeDef - specify a DMA request.
 * @return @ref FunctionalState - the current work state of the DMA request sources.
 */
FunctionalState TIMER_GetDMACmdState(MDR_TIMER_TypeDef* TIMERx, TIMER_Flags_TypeDef DMAReq)
{
    FunctionalState State;

    /* Check the parameters. */
    assert_param(IS_TIMER_ALL_PERIPH(TIMERx));
    assert_param(IS_TIMER_FLAG(DMAReq));

    if ((TIMERx->DMA_RE & (uint32_t)DMAReq) == 0) {
        State = DISABLE;
    } else {
        State = ENABLE;
    }

    return State;
}

/** @} */ /* End of the group TIMER_Exported_Functions */

/** @} */ /* End of the group TIMER */

/** @} */ /* End of the group MDR32VF0xI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32VF0xI_timer.c */

